tutorials/fluids/nozelBump/gas/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// libs
// (

//         "libmyBCsLib.so"


// )

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          1e-3;

writeControl    timeStep;

writeInterval   10;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression no;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable yes;

adjustTimeStep  no;

// maxCo
maxCo           0.1;

functions
{
//     forces
// {
//     type            forceCoeffs;
//     libs            ("libforces.so");
//     writeControl    timeStep;
//     writeInterval   1;

//     patches         (cylinder);
//     rho             rhoInf;      // Indicates incompressible
//     log             true;
//     rhoInf          1.0;         // Redundant for incompressible
//     liftDir         (0 1 0);
//     dragDir         (1 0 0);
//     CofR            (0 0 0);     // Axle midpoint on ground
//     pitchAxis       (0 0 1);
//     magUInf         1.0;
//     lRef            1.0;
//     Aref            2.0;
// }
        MachNumber
    {
        type MachNumber;
        functionObjectLibs ("libutilityFunctionObjects.so");
        UName           U;
    }
    // #include "surfaces"

}
// ************************************************************************* //
