tutorials/fluids/nozelBump/gas/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// thermoType      hPsiThermo<pureMixture<constTransport<specieThermo<hConstThermo<perfectGas>>>>>;

// name, nMoles, mol weight, CP, Hf, mu, Pr;
// mixture         air 1 28.97 1005 0 0 0.7;
//mixture         air 1 11640.2561438975 2.5 0 0 0.7;
thermoType     externalStiffenedGasThermo ;//externalStiffenedGasThermo;



// stiffenedGasCoeffs
// {
//     gamma  1.9385878857433527;
//     pInf 1158907006.529626;
//     Cv 4130.18;
//     q  -2289365.0741818445;
//     mu 0;
//     Pr 7;
// };

stiffenedGasCoeffs
{
    gamma  1.4;
    pInf 0;
    Cv 718;
    q  0;
    mu 0;
    Pr 0.7;
};

// ************************************************************************* //
