tutorials/fluids/nozelBump/gas/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    emptyPlanes
    {
        type            empty;
    }
    "(.*Wall)"
    {
        type           slip;
        // type           fixedValue;
        // value         uniform (0 0 0);
    }
    inlet
    {
        type           fixedValue;
        value          $internalField;
     
        // type                mySubsonicInletTotal;
	    // inletDirection      uniform (1 0 0);
        // value		       uniform (3.471852 0 0);
     
        // type            farfieldRiemann;
        // UInf            (3.471852 0 0);
        // pInf            1e5;
        // TInf            300;
        // gamma           1.4;
        // R               287.058;
        // pName           p;
        // TName           T;
        // value           $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }

}

// ************************************************************************* //
